In [1]:
import pandas as pd

In [2]:
names={'vrushali':'engineer','diksha':'doctor','moksha':'teacher'}
names

{'vrushali': 'engineer', 'diksha': 'doctor', 'moksha': 'teacher'}

In [3]:
a=pd.Series(names)
a

vrushali    engineer
diksha        doctor
moksha       teacher
dtype: object

In [4]:
#dataframe

In [5]:
details_info={'NAME':['Vrushali','Diksha','Pranav','Darshan'],
                          'LOCATION':['Pune','Mumbai','Jalgaon','nashik'],
                          'EDUCATION':['Engineer','Engineer','Engineer','Engineer']
                          }
details_info

{'NAME': ['Vrushali', 'Diksha', 'Pranav', 'Darshan'],
 'LOCATION': ['Pune', 'Mumbai', 'Jalgaon', 'nashik'],
 'EDUCATION': ['Engineer', 'Engineer', 'Engineer', 'Engineer']}

In [6]:
pd.DataFrame(details_info)

       NAME LOCATION EDUCATION
0  Vrushali     Pune  Engineer
1    Diksha   Mumbai  Engineer
2    Pranav  Jalgaon  Engineer
3   Darshan   nashik  Engineer

In [7]:
pd.read_csv(r"C:\Users\Sarvadnya\FUSIONCLASS\Python Files\files.py\Datasets\Used_Cars.csv")

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [8]:
df=pd.read_csv(r"C:\Users\Sarvadnya\FUSIONCLASS\Python Files\files.py\Datasets\Used_Cars.csv",index_col=0)
df.head(10)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
5,Hyundai EON LPG Era Plus Option,Hyderabad,2012,75000,LPG,Manual,First,21.1 km/kg,814 CC,55.2 bhp,5.0,NaN,2.35
6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,3.50
7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36 kmpl,2755 CC,171.5 bhp,8.0,21 Lakh,17.50
8,Volkswagen Vento Diesel Comfortline,Pune,2013,64430,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,5.20
9,Tata Indica Vista Quadrajet LS,Chennai,2012,65932,Diesel,Manual,Second,22.3 kmpl,1248 CC,74 bhp,5.0,NaN,1.95

In [9]:
df.tail(5)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [10]:
df.head(5)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [11]:
df.shape

(7253, 13)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7253 entries, 0 to 7252
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               7253 non-null   object
 1   Location           7253 non-null   object
 2   Year               7253 non-null   int64
 3   Kilometers_Driven  7253 non-null   int64
 4   Fuel_Type          7253 non-null   object
 5   Transmission       7253 non-null   object
 6   Owner_Type         7253 non-null   object
 7   Mileage            7251 non-null   object
 8   Engine             7207 non-null   object
 9   Power              7207 non-null   object
 10  Seats              7200 non-null   float64
 11  New_Price          1006 non-null   object
 12  Price              6019 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 793.3+ KB

In [13]:
df.describe()

              Year  Kilometers_Driven        Seats        Price
count  7253.000000       7.253000e+03  7200.000000  6019.000000
mean   2013.365366       5.869906e+04     5.279722     9.479468
std       3.254421       8.442772e+04     0.811660    11.187917
min    1996.000000       1.710000e+02     0.000000     0.440000
25%    2011.000000       3.400000e+04     5.000000     3.500000
50%    2014.000000       5.341600e+04     5.000000     5.640000
75%    2016.000000       7.300000e+04     5.000000     9.950000
max    2019.000000       6.500000e+06    10.000000   160.000000

In [14]:
df.columns

Index(['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'New_Price', 'Price'],
      dtype='object')

In [15]:
df.dtypes

Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
New_Price             object
Price                float64
dtype: object

In [16]:
df.ndim

2

In [17]:
df.describe(include=object)

,Name,Location,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,New_Price
count,7253,7253,7253,7253,7253,7251,7207,7207,1006
unique,2041,11,5,2,4,450,150,386,625
top,Mahindra XUV500 W8 2WD,Mumbai,Diesel,Manual,First,17.0 kmpl,1197 CC,74 bhp,95.13 Lakh
freq,55,949,3852,5204,5952,207,732,280,6

In [18]:
df.head(5)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [19]:
df['Location']

S.No.
0           Mumbai
1             Pune
2          Chennai
3          Chennai
4       Coimbatore
           ...
7248     Hyderabad
7249        Mumbai
7250       Kolkata
7251          Pune
7252         Kochi
Name: Location, Length: 7253, dtype: object

In [20]:
df[['Fuel_Type','Mileage','Price']]

      Fuel_Type     Mileage  Price
S.No.
0           CNG  26.6 km/kg   1.75
1        Diesel  19.67 kmpl  12.50
2        Petrol   18.2 kmpl   4.50
3        Diesel  20.77 kmpl   6.00
4        Diesel   15.2 kmpl  17.74
...         ...         ...    ...
7248     Diesel  20.54 kmpl    NaN
7249     Petrol  17.21 kmpl    NaN
7250     Diesel  23.08 kmpl    NaN
7251     Petrol   17.2 kmpl    NaN
7252     Diesel   10.0 kmpl    NaN

[7253 rows x 3 columns]

In [21]:
df.head(5)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [22]:
df.loc[1:10,'Year':'Engine']

,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine
S.No.,,,,,,,
1,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC
2,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC
3,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC
4,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC
5,2012,75000,LPG,Manual,First,21.1 km/kg,814 CC
6,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC
7,2016,36000,Diesel,Automatic,First,11.36 kmpl,2755 CC
8,2013,64430,Diesel,Manual,First,20.54 kmpl,1598 CC
9,2012,65932,Diesel,Manual,Second,22.3 kmpl,1248 CC
10,2018,25692,Petrol,Manual,First,21.56 kmpl,1462 CC

In [23]:
df.iloc[5:11,2:5]

       Year  Kilometers_Driven Fuel_Type
S.No.
5      2012              75000       LPG
6      2013              86999    Diesel
7      2016              36000    Diesel
8      2013              64430    Diesel
9      2012              65932    Diesel
10     2018              25692    Petrol

In [24]:
df.loc[[7,8],['Kilometers_Driven','Fuel_Type']]

       Kilometers_Driven Fuel_Type
S.No.
7                  36000    Diesel
8                  64430    Diesel

In [26]:
df.iloc[[7,8],[5,4]]

      Transmission Fuel_Type
S.No.
7        Automatic    Diesel
8           Manual    Diesel

In [27]:
df['Location']=='Mumbai'

S.No.
0        True
1       False
2       False
3       False
4       False
        ...
7248    False
7249     True
7250    False
7251    False
7252    False
Name: Location, Length: 7253, dtype: bool

In [28]:
df[df['Location']=='Mumbai']

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36 kmpl,2755 CC,171.5 bhp,8.0,21 Lakh,17.50
22,Audi A6 2011-2015 35 TFSI Technology,Mumbai,2015,55985,Petrol,Automatic,First,13.53 kmpl,1984 CC,177.01 bhp,5.0,NaN,23.50
25,Honda City Corporate Edition,Mumbai,2012,51920,Petrol,Manual,First,16.8 kmpl,1497 CC,116.3 bhp,5.0,NaN,4.25
29,Toyota Innova 2.5 V Diesel 7-seater,Mumbai,2007,262000,Diesel,Manual,Fourth & Above,12.8 kmpl,2494 CC,102 bhp,7.0,NaN,4.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7185,Hyundai i20 Asta Option 1.2,Mumbai,2015,31293,Petrol,Manual,First,18.6 kmpl,1197 CC,81.83 bhp,5.0,NaN,NaN
7218,Maruti Vitara Brezza ZDi Plus AMT,Mumbai,2018,3800,Diesel,Automatic,First,24.3 kmpl,1248 CC,88.5 bhp,5.0,12.46 Lakh,NaN
7229,Volkswagen Vento Petrol Highline AT,Mumbai,2011,67500,Petrol,Automatic,Second,14.4 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7232,Jeep Compass 1.4 Sport,Mumbai,2018,6000,Petrol,Manual,First,16.0 kmpl,1368 CC,160 bhp,5.0,18.16 Lakh,NaN
7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN

In [30]:
df[df['Kilometers_Driven']>50000]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
5,Hyundai EON LPG Era Plus Option,Hyderabad,2012,75000,LPG,Manual,First,21.1 km/kg,814 CC,55.2 bhp,5.0,NaN,2.35
6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,3.50
8,Volkswagen Vento Diesel Comfortline,Pune,2013,64430,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,5.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7243,Renault Duster 85PS Diesel RxL,Chennai,2015,70000,Diesel,Manual,First,19.87 kmpl,1461 CC,83.8 bhp,5.0,NaN,NaN
7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [33]:
df[(df['Fuel_Type']=='CNG')&(df['Owner_Type']=='First')]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
127,Maruti Wagon R LXI CNG,Pune,2013,89900,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.25
328,Maruti Zen Estilo LXI Green (CNG),Pune,2008,42496,CNG,Manual,First,26.3 km/kg,998 CC,67.1 bhp,5.0,NaN,1.40
440,Maruti Eeco 5 STR With AC Plus HTR CNG,Kochi,2017,31841,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,NaN,4.70
839,Maruti Alto Green LXi (CNG),Delhi,2012,65537,CNG,Manual,First,26.83 km/kg,796 CC,38.4 bhp,5.0,NaN,2.10
1135,Maruti Zen Estilo LXI Green (CNG),Ahmedabad,2011,76000,CNG,Manual,First,26.3 km/kg,998 CC,67.1 bhp,5.0,NaN,2.00
1218,Maruti Wagon R LXI CNG,Pune,2015,70000,CNG,Manual,First,26.2 km/kg,998 CC,58.2 bhp,5.0,NaN,3.65
1269,Maruti Alto 800 2016-2019 CNG LXI,Mumbai,2018,10600,CNG,Manual,First,33.44 km/kg,796 CC,40.3 bhp,4.0,NaN,3.50
1323,Maruti Eeco 5 STR With AC Plus HTR CNG,Mumbai,2018,20000,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,NaN,4.50
1332,Maruti Wagon R CNG LXI,Pune,2013,79494,CNG,Manual,First,33.54 km/kg,998 CC,67.04 bhp,5.0,5.54 Lakh,2.96
1573,Maruti Ertiga VXI CNG,Mumbai,2017,19234,CNG,Manual,First,17.5 km/kg,1373 CC,80.46 bhp,7.0,NaN,8.35
1780,Maruti Wagon R LXI CNG,Mumbai,2013,25755,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.15
1911,Maruti Wagon R LXI CNG,Ahmedabad,2016,77000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.30
1914,Hyundai Xcent 1.2 Kappa S Option CNG,Chennai,2017,46000,CNG,Manual,First,25.0 km/kg,1197 CC,81.86 bhp,5.0,NaN,4.95
2059,Maruti Wagon R CNG LXI,Mumbai,2013,54000,CNG,Manual,First,33.54 km/kg,998 CC,67.04 bhp,5.0,5.58 Lakh,3.05
2110,Tata Indigo CS Emax CNG GLX,Pune,2014,41000,CNG,Manual,First,24.6 km/kg,1193 CC,55.23 bhp,5.0,NaN,3.25
2228,Maruti Ertiga VXI CNG,Mumbai,2016,65263,CNG,Manual,First,17.5 km/kg,1373 CC,80.46 bhp,7.0,NaN,7.50
2323,Hyundai Xcent 1.2 Kappa S Option CNG,Delhi,2016,36676,CNG,Manual,First,25.0 km/kg,1197 CC,81.86 bhp,5.0,NaN,5.00
2371,Maruti Wagon R CNG LXI,Pune,2014,29202,CNG,Manual,First,33.54 km/kg,998 CC,67.04 bhp,5.0,5.54 Lakh,3.90
2437,Tata Indigo CS Emax CNG GLX,Chennai,2015,75000,CNG,Manual,First,24.6 km/kg,1193 CC,55.23 bhp,5.0,NaN,3.25
2516,Maruti SX4 Green Vxi (CNG),Mumbai,2014,53000,CNG,Manual,First,22.1 km/kg,1586 CC,85.7 bhp,5.0,NaN,3.26
2638,Maruti Wagon R LXI CNG,Pune,2012,90400,CNG,Manual,First,26.2 km/kg,998 CC,58.2 bhp,5.0,NaN,2.90
2701,Maruti Celerio CNG VXI MT,Kochi,2016,70536,CNG,Manual,First,31.79 km/kg,998 CC,58.33 bhp,5.0,5.87 Lakh,4.58
3031,Maruti Ertiga VXI CNG,Mumbai,2013,53000,CNG,Manual,First,22.8 km/kg,1373 CC,80.9 bhp,7.0,NaN,5.80
3119,Maruti Alto K10 LXI CNG Optional,Kochi,2018,44202,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,4.66 Lakh,4.00
3129,Maruti Wagon R CNG LXI,Delhi,2014,74663,CNG,Manual,First,33.54 km/kg,998 CC,67.04 bhp,5.0,5.35 Lakh,3.25
3180,Maruti Eeco CNG 5 Seater AC,Ahmedabad,2015,47001,CNG,Manual,First,20.0 km/kg,1196 CC,63 bhp,5.0,5.36 Lakh,3.72
3295,Maruti Wagon R LXI CNG,Delhi,2013,62000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,2.80
3455,Maruti Wagon R LXI CNG,Mumbai,2014,41000,CNG,Manual,First,26.2 km/kg,998 CC,58.2 bhp,5.0,NaN,3.50
3553,Maruti Alto 800 2016-2019 CNG LXI,Pune,2015,18000,CNG,Manual,First,33.44 km/kg,796 CC,40.3 bhp,4.0,NaN,3.00
3722,Maruti SX4 Green Vxi (CNG),Kochi,2015,61000,CNG,Manual,First,22.1 km/kg,1586 CC,85.7 bhp,5.0,NaN,3.89
4098,Maruti SX4 Green Vxi (CNG),Delhi,2012,82069,CNG,Manual,First,21.4 km/kg,1586 CC,103.3 bhp,5.0,NaN,2.65
4141,Maruti Wagon R CNG LXI,Mumbai,2014,47200,CNG,Manual,First,33.54 km/kg,998 CC,67.04 bhp,5.0,5.58 Lakh,2.85
4411,Maruti Wagon R LXI CNG,Kochi,2014,68365,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.77
4603,Maruti Eeco 5 STR With AC Plus HTR CNG,Kochi,2019,21112,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,NaN,5.38
4769,Maruti Alto 800 2016-2019 CNG LXI,Kochi,2017,24310,CNG,Manual,First,33.44 km/kg,796 CC,40.3 bhp,4.0,NaN,3.70
4920,Maruti Wagon R LXI CNG,Pune,2014,58000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.00
5004,Maruti Eeco 5 STR With AC Plus HTR CNG,Kochi,2018,43912,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,NaN,4.33
5178,Maruti Celerio CNG VXI MT,Delhi,2015,64687,CNG,Manual,First,31.79 km/kg,998 CC,58.33 bhp,5.0,5.87 Lakh,3.80
5655,Maruti Wagon R LXI CNG,Mumbai,2015,22001,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.65
5710,Maruti Alto 800 CNG LXI,Mumbai,2013,26200,CNG,Manual,First,30.46 km/kg,796 CC,47.3 bhp,5.0,NaN,2.15
5747,Maruti Wagon R LXI CNG,Delhi,2014,62549,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,2.95
5876,Maruti Ertiga VXI CNG,Mumbai,2017,23700,CNG,Manual,First,17.5 km/kg,1373 CC,80.46 bhp,7.0,NaN,8.25
5881,Maruti Wagon R LXI CNG,Pune,2015,55000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,3.70
5902,Maruti Wagon R LXI CNG,Mumbai,2012,72000,CNG,Manual,First,26.2 km/kg,998 CC,58.2 bhp,5.0,NaN,2.25
6019,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,NaN,NaN
6387,Hyundai Santro Xing GLS CNG,Bangalore,2011,43985,CNG,Manual,First,11.88 km/kg,1086 CC,62.1 bhp,5.0,NaN,NaN
6538,Maruti Alto K10 LXI CNG,Kochi,2015,47490,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,NaN,NaN
6788,Maruti Alto K10 LXI CNG Optional,Delhi,2017,33000,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,4.66 Lakh,NaN
6926,Maruti Eeco 5 STR With AC Plus HTR CNG,Mumbai,2017,15500,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,NaN,NaN
6958,Maruti Alto 800 CNG LXI,Kolkata,2013,14311,CNG,Manual,First,30.46 km/kg,796 CC,47.3 bhp,5.0,NaN,NaN

In [34]:
df['Price'].mean()

np.float64(9.47946835022429)

In [35]:
mumbai=df[df['Location']=='Mumbai']
mumbai

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36 kmpl,2755 CC,171.5 bhp,8.0,21 Lakh,17.50
22,Audi A6 2011-2015 35 TFSI Technology,Mumbai,2015,55985,Petrol,Automatic,First,13.53 kmpl,1984 CC,177.01 bhp,5.0,NaN,23.50
25,Honda City Corporate Edition,Mumbai,2012,51920,Petrol,Manual,First,16.8 kmpl,1497 CC,116.3 bhp,5.0,NaN,4.25
29,Toyota Innova 2.5 V Diesel 7-seater,Mumbai,2007,262000,Diesel,Manual,Fourth & Above,12.8 kmpl,2494 CC,102 bhp,7.0,NaN,4.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7185,Hyundai i20 Asta Option 1.2,Mumbai,2015,31293,Petrol,Manual,First,18.6 kmpl,1197 CC,81.83 bhp,5.0,NaN,NaN
7218,Maruti Vitara Brezza ZDi Plus AMT,Mumbai,2018,3800,Diesel,Automatic,First,24.3 kmpl,1248 CC,88.5 bhp,5.0,12.46 Lakh,NaN
7229,Volkswagen Vento Petrol Highline AT,Mumbai,2011,67500,Petrol,Automatic,Second,14.4 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7232,Jeep Compass 1.4 Sport,Mumbai,2018,6000,Petrol,Manual,First,16.0 kmpl,1368 CC,160 bhp,5.0,18.16 Lakh,NaN
7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN

In [36]:
mumbai['Price'].mean()

np.float64(9.429329113924052)

In [37]:
df[df['Location']=='Mumbai']['Price'].mean()

np.float64(9.429329113924052)

In [38]:
df[df['Location']=='Pune']['Price'].mean()

np.float64(6.726254019292604)

# groupby
* split data into group based on one or more columns,apply some calculations ( min ,max,sum,count ) to each  group

In [39]:
df.groupby('Location')['Price'].sum()

Location
Ahmedabad     1894.44
Bangalore     4771.65
Chennai       3830.29
Coimbatore    9589.75
Delhi         5378.08
Hyderabad     7254.20
Jaipur        2399.21
Kochi         7277.65
Kolkata       3028.75
Mumbai        7449.17
Pune          4183.73
Name: Price, dtype: float64

In [47]:
df.groupby(df['Fuel_Type']=='CNG')['Price'].mean()

Fuel_Type
False    9.535465
True     3.516786
Name: Price, dtype: float64

In [48]:
df.groupby(df['Location']=='Mumbai')['Price'].sum()

Location
False    49607.75
True      7449.17
Name: Price, dtype: float64

In [51]:
df.groupby('Transmission')['Price'].mean()

Transmission
Automatic    19.843971
Manual        5.332703
Name: Price, dtype: float64

In [52]:
df.head(5)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
S.No.,,,,,,,,,,,,,
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [54]:
df.groupby(['Location','Fuel_Type'])[['Price']].mean()

                          Price
Location   Fuel_Type
Ahmedabad  CNG         3.006667
           Diesel     10.859420
           Petrol      4.660482
Bangalore  CNG              NaN
           Diesel     17.245388
           Petrol      7.157626
Chennai    CNG         4.100000
           Diesel     10.413080
           Electric   13.000000
           Petrol      3.958960
Coimbatore Diesel     20.747275
           Petrol      7.870429
Delhi      CNG         3.010000
           Diesel     12.554510
           Petrol      6.328992
Hyderabad  CNG         2.316667
           Diesel     11.955731
           LPG         2.775000
           Petrol      5.202643
Jaipur     Diesel      7.964304
           LPG         2.560000
           Petrol      3.106630
Kochi      CNG         4.293750
           Diesel     15.515888
           Petrol      7.452714
Kolkata    CNG              NaN
           Diesel      6.773594
           Petrol      4.640538
Mumbai     CNG         4.118235
           Diesel     14.288626
           Electric   12.750000
           LPG         1.450000
           Petrol      6.315764
Pune       CNG         2.946923
           Diesel      9.851076
           LPG         1.650000
           Petrol      4.083312

In [61]:
df[['Location','Fuel_Type']]

         Location Fuel_Type
S.No.
0          Mumbai       CNG
1            Pune    Diesel
2         Chennai    Petrol
3         Chennai    Diesel
4      Coimbatore    Diesel
...           ...       ...
7248    Hyderabad    Diesel
7249       Mumbai    Petrol
7250      Kolkata    Diesel
7251         Pune    Petrol
7252        Kochi    Diesel

[7253 rows x 2 columns]

In [62]:
#data manipulation

In [63]:
import pandas as pd
df=pd.read_csv(r"C:\Users\Sarvadnya\FUSIONCLASS\Python Files\files.py\Datasets\vgsales.csv")
df

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [65]:
df['new column']='Game data'
df

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,Game data
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,Game data
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,Game data
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,Game data
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,Game data
...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,Game data
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,Game data
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,Game data
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,Game data
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,Game data

In [67]:
df['Date']='null'
df

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,date,null
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null

In [79]:
df.drop(columns=['new column','Date'])

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [80]:
df.drop(index=[1])

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26,date,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null

In [82]:
df.rename(columns={'NA_Sales':'north america'},inplace=True)
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,date,null
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null

In [83]:
df.sort_index()

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,date,null
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null

In [85]:
df.sort_index(ascending=False)

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,date,null
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null

In [87]:
df.sort_index(axis=1,ascending=False)

,north america,new column,Year,Rank,Publisher,Platform,Other_Sales,Name,JP_Sales,Global_Sales,Genre,EU_Sales,Date
0,41.49,date,2006.0,1,Nintendo,Wii,8.46,Wii Sports,3.77,82.74,Sports,29.02,null
1,29.08,date,1985.0,2,Nintendo,NES,0.77,Super Mario Bros.,6.81,40.24,Platform,3.58,null
2,15.85,date,2008.0,3,Nintendo,Wii,3.31,Mario Kart Wii,3.79,35.82,Racing,12.88,null
3,15.75,date,2009.0,4,Nintendo,Wii,2.96,Wii Sports Resort,3.28,33.00,Sports,11.01,null
4,11.27,date,1996.0,5,Nintendo,GB,1.00,Pokemon Red/Pokemon Blue,10.22,31.37,Role-Playing,8.89,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,0.01,date,2002.0,16596,Kemco,GBA,0.00,Woody Woodpecker in Crazy Castle 5,0.00,0.01,Platform,0.00,null
16594,0.01,date,2003.0,16597,Infogrames,GC,0.00,Men in Black II: Alien Escape,0.00,0.01,Shooter,0.00,null
16595,0.00,date,2008.0,16598,Activision,PS2,0.00,SCORE International Baja 1000: The Official Game,0.00,0.01,Racing,0.00,null
16596,0.00,date,2010.0,16599,7G//AMES,DS,0.00,Know How 2,0.00,0.01,Puzzle,0.01,null
16597,0.01,date,2003.0,16600,Wanadoo,GBA,0.00,Spirits & Spells,0.00,0.01,Platform,0.00,null

In [90]:
df.sort_values(by='north america',ascending=False).head(5)
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,date,null
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null

# add new column

In [92]:
df['Age']=2025-df['Year']
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new column,Date,Age
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,date,null,19.0
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,date,null,40.0
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,date,null,17.0
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,date,null,16.0
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,date,null,29.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,date,null,23.0
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,date,null,22.0
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,date,null,17.0
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,date,null,15.0
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,date,null,22.0

In [105]:
#df.drop(columns=['new column'],inplace=True)
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Date,Age
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,null,19.0
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,null,40.0
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,null,17.0
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,null,16.0
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,null,29.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,null,23.0
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,null,22.0
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,null,17.0
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,null,15.0
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,null,22.0

In [107]:
df.drop(columns=['Date'],inplace=True)

In [108]:
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Age
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,19.0
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,40.0
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,17.0
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,16.0
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,29.0
...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,23.0
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,22.0
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,17.0
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,15.0
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,22.0

In [109]:
df['10% GS']=df['Global_Sales'].apply(lambda x : x*0.1)

In [110]:
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Age,10% GS
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,19.0,8.274
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,40.0,4.024
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,17.0,3.582
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,16.0,3.300
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,29.0,3.137
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,23.0,0.001
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,22.0,0.001
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,17.0,0.001
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,15.0,0.001
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,22.0,0.001

In [111]:
df['Seller']=df['Global_Sales'].apply(lambda x: 'Top seller' if x>50 else 'lower seller')
df

,Rank,Name,Platform,Year,Genre,Publisher,north america,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Age,10% GS,Seller
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,19.0,8.274,Top seller
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,40.0,4.024,lower seller
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,17.0,3.582,lower seller
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,16.0,3.300,lower seller
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,29.0,3.137,lower seller
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,23.0,0.001,lower seller
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,22.0,0.001,lower seller
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,17.0,0.001,lower seller
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,15.0,0.001,lower seller
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,22.0,0.001,lower seller

# Map function

In [112]:
import pandas as pd

In [114]:
cars=pd.read_csv(r"C:\Users\Sarvadnya\FUSIONCLASS\Python Files\files.py\Datasets\Used_Cars.csv")
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [116]:
cars.shape

(7253, 14)

In [119]:
cars.dtypes

S.No.                  int64
Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
New_Price             object
Price                float64
dtype: object

In [120]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   object
 9   Engine             7207 non-null   object
 10  Power              7207 non-null   object
 11  Seats              7200 non-null   float64
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 793.4+ KB

In [121]:
cars.describe()

             S.No.         Year  Kilometers_Driven        Seats        Price
count  7253.000000  7253.000000       7.253000e+03  7200.000000  6019.000000
mean   3626.000000  2013.365366       5.869906e+04     5.279722     9.479468
std    2093.905084     3.254421       8.442772e+04     0.811660    11.187917
min       0.000000  1996.000000       1.710000e+02     0.000000     0.440000
25%    1813.000000  2011.000000       3.400000e+04     5.000000     3.500000
50%    3626.000000  2014.000000       5.341600e+04     5.000000     5.640000
75%    5439.000000  2016.000000       7.300000e+04     5.000000     9.950000
max    7252.000000  2019.000000       6.500000e+06    10.000000   160.000000

In [123]:
cars.columns

Index(['S.No.', 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'New_Price', 'Price'],
      dtype='object')

In [125]:
cars.describe(include=object)

,Name,Location,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,New_Price
count,7253,7253,7253,7253,7253,7251,7207,7207,1006
unique,2041,11,5,2,4,450,150,386,625
top,Mahindra XUV500 W8 2WD,Mumbai,Diesel,Manual,First,17.0 kmpl,1197 CC,74 bhp,95.13 Lakh
freq,55,949,3852,5204,5952,207,732,280,6

In [126]:
cars.head(3)

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50

In [128]:
cars.value_counts(['Owner_Type'])

Owner_Type
First             5952
Second            1152
Third              137
Fourth & Above      12
Name: count, dtype: int64

In [134]:
cars['Owner']=cars['Owner_Type'].map({'First':1,'Second':2,'Third':3,'Fourth' :4})
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75,1.0
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50,1.0
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50,1.0
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00,1.0
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN,1.0
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,1.0
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN,1.0
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,3.0
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN,1.0

In [135]:
cars['Name']=cars['Name'].str.upper()
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner
0,0,MARUTI WAGON R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75,1.0
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50,1.0
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50,1.0
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00,1.0
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,VOLKSWAGEN VENTO DIESEL TRENDLINE,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN,1.0
7249,7249,VOLKSWAGEN POLO GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,1.0
7250,7250,NISSAN MICRA DIESEL XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN,1.0
7251,7251,VOLKSWAGEN POLO GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,3.0
7252,7252,MERCEDES-BENZ E-CLASS 2009-2013 E 220 CDI AVAN...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN,1.0

In [136]:
cars['Owner_Type']=cars['Owner_Type'].str.lower()
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner
0,0,MARUTI WAGON R LXI CNG,Mumbai,2010,72000,CNG,Manual,first,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75,1.0
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50,1.0
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,first,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50,1.0
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,first,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00,1.0
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,VOLKSWAGEN VENTO DIESEL TRENDLINE,Hyderabad,2011,89411,Diesel,Manual,first,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN,1.0
7249,7249,VOLKSWAGEN POLO GT TSI,Mumbai,2015,59000,Petrol,Automatic,first,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,1.0
7250,7250,NISSAN MICRA DIESEL XV,Kolkata,2012,28000,Diesel,Manual,first,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN,1.0
7251,7251,VOLKSWAGEN POLO GT TSI,Pune,2013,52262,Petrol,Automatic,third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,3.0
7252,7252,MERCEDES-BENZ E-CLASS 2009-2013 E 220 CDI AVAN...,Kochi,2014,72443,Diesel,Automatic,first,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN,1.0

In [139]:
Creta=cars[cars['Name'].str.contains('CRETA')]
Creta

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50,1.0
69,69,HYUNDAI CRETA 1.4 E PLUS DIESEL,Mumbai,2018,13000,Diesel,Manual,first,22.1 kmpl,1396 CC,88.7 bhp,5.0,11.81 Lakh,10.50,1.0
213,213,HYUNDAI CRETA 1.6 VTVT S,Delhi,2015,27057,Petrol,Manual,second,15.29 kmpl,1591 CC,121.3 bhp,5.0,NaN,8.15,2.0
267,267,HYUNDAI CRETA 1.6 CRDI SX,Bangalore,2016,28000,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,13.75,1.0
425,425,HYUNDAI CRETA 1.6 SX PLUS DUAL TONE PETROL,Coimbatore,2017,23163,Petrol,Manual,first,15.29 kmpl,1591 CC,121.3 bhp,5.0,NaN,12.03,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7088,7088,HYUNDAI CRETA 1.6 CRDI SX,Coimbatore,2017,33186,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,NaN,1.0
7109,7109,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2016,83500,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,NaN,1.0
7146,7146,HYUNDAI CRETA 1.6 CRDI SX,Jaipur,2015,65000,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,NaN,1.0
7158,7158,HYUNDAI CRETA 1.6 SX PLUS PETROL AUTOMATIC,Coimbatore,2018,32746,Petrol,Automatic,first,13.0 kmpl,1591 CC,121.3 bhp,5.0,NaN,NaN,1.0
7217,7217,HYUNDAI CRETA 1.6 SX PLUS DUAL TONE PETROL,Delhi,2017,11000,Petrol,Manual,first,15.29 kmpl,1591 CC,121.3 bhp,5.0,NaN,NaN,1.0

In [140]:
cars['Average']=cars['Mileage'].str.split().str[0]

In [141]:
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
0,0,MARUTI WAGON R LXI CNG,Mumbai,2010,72000,CNG,Manual,first,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75,1.0,26.6
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,first,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50,1.0,19.67
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,first,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50,1.0,18.2
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,first,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00,1.0,20.77
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74,2.0,15.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,VOLKSWAGEN VENTO DIESEL TRENDLINE,Hyderabad,2011,89411,Diesel,Manual,first,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN,1.0,20.54
7249,7249,VOLKSWAGEN POLO GT TSI,Mumbai,2015,59000,Petrol,Automatic,first,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,1.0,17.21
7250,7250,NISSAN MICRA DIESEL XV,Kolkata,2012,28000,Diesel,Manual,first,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN,1.0,23.08
7251,7251,VOLKSWAGEN POLO GT TSI,Pune,2013,52262,Petrol,Automatic,third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN,3.0,17.2
7252,7252,MERCEDES-BENZ E-CLASS 2009-2013 E 220 CDI AVAN...,Kochi,2014,72443,Diesel,Automatic,first,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN,1.0,10.0

In [158]:
cars.head(5)

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
0,0,MARUTI WAGON R LXI CNG,Mumbai,2010,72000,CNG,Manual,first,26.6 km/kg,NaN,58.16 bhp,5.0,NaN,1.75,1.0,26.6
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,first,19.67 kmpl,NaN,126.2 bhp,5.0,NaN,12.50,1.0,19.67
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,first,18.2 kmpl,NaN,88.7 bhp,5.0,8.61 Lakh,4.50,1.0,18.2
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,first,20.77 kmpl,NaN,88.76 bhp,7.0,NaN,6.00,1.0,20.77
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,second,15.2 kmpl,NaN,140.8 bhp,5.0,NaN,17.74,2.0,15.2

In [151]:
#cars.groupby('Fuel_Type')['Average'].mean()

In [159]:
cars['Engine']=cars['Engine'].str.split().str[0]

AttributeError: Can only use .str accessor with string values!

In [157]:
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
0,0,MARUTI WAGON R LXI CNG,Mumbai,2010,72000,CNG,Manual,first,26.6 km/kg,NaN,58.16 bhp,5.0,NaN,1.75,1.0,26.6
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,first,19.67 kmpl,NaN,126.2 bhp,5.0,NaN,12.50,1.0,19.67
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,first,18.2 kmpl,NaN,88.7 bhp,5.0,8.61 Lakh,4.50,1.0,18.2
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,first,20.77 kmpl,NaN,88.76 bhp,7.0,NaN,6.00,1.0,20.77
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,second,15.2 kmpl,NaN,140.8 bhp,5.0,NaN,17.74,2.0,15.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,VOLKSWAGEN VENTO DIESEL TRENDLINE,Hyderabad,2011,89411,Diesel,Manual,first,20.54 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,1.0,20.54
7249,7249,VOLKSWAGEN POLO GT TSI,Mumbai,2015,59000,Petrol,Automatic,first,17.21 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,1.0,17.21
7250,7250,NISSAN MICRA DIESEL XV,Kolkata,2012,28000,Diesel,Manual,first,23.08 kmpl,NaN,63.1 bhp,5.0,NaN,NaN,1.0,23.08
7251,7251,VOLKSWAGEN POLO GT TSI,Pune,2013,52262,Petrol,Automatic,third,17.2 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,3.0,17.2
7252,7252,MERCEDES-BENZ E-CLASS 2009-2013 E 220 CDI AVAN...,Kochi,2014,72443,Diesel,Automatic,first,10.0 kmpl,NaN,170 bhp,5.0,NaN,NaN,1.0,10.0

In [164]:
cars['Location'].nunique()

11

In [165]:
cars['Location'].unique()

array(['Mumbai', 'Pune', 'Chennai', 'Coimbatore', 'Hyderabad', 'Jaipur',
       'Kochi', 'Kolkata', 'Delhi', 'Bangalore', 'Ahmedabad'],
      dtype=object)

In [167]:
cars['Name'].unique()

array(['MARUTI WAGON R LXI CNG', 'HYUNDAI CRETA 1.6 CRDI SX OPTION',
       'HONDA JAZZ V', ..., 'FORD ECOSPORT 1.5 PETROL AMBIENTE',
       'JEEP COMPASS 1.4 SPORT', 'HYUNDAI ELITE I20 MAGNA PLUS'],
      shape=(2017,), dtype=object)

In [168]:
cars.nunique()

S.No.                7253
Name                 2017
Location               11
Year                   23
Kilometers_Driven    3660
Fuel_Type               5
Transmission            2
Owner_Type              4
Mileage               450
Engine                  0
Power                 386
Seats                   9
New_Price             625
Price                1373
Owner                   3
Average               438
dtype: int64

In [169]:
cars['Name'].nunique()

2017

In [173]:
cars.nlargest(4,'Price')

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
4079,4079,LAND ROVER RANGE ROVER 3.0 DIESEL LWB VOGUE,Hyderabad,2017,25000,Diesel,Automatic,first,13.33 kmpl,NaN,255 bhp,5.0,2.3 Cr,160.00,1.0,13.33
5781,5781,LAMBORGHINI GALLARDO COUPE,Delhi,2011,6500,Petrol,Automatic,third,6.4 kmpl,NaN,560 bhp,2.0,NaN,120.00,3.0,6.4
5919,5919,JAGUAR F TYPE 5.0 V8 S,Hyderabad,2015,8000,Petrol,Automatic,first,12.5 kmpl,NaN,488.1 bhp,2.0,NaN,100.00,1.0,12.5
1505,1505,LAND ROVER RANGE ROVER SPORT SE,Kochi,2019,26013,Diesel,Automatic,first,12.65 kmpl,NaN,255 bhp,5.0,1.39 Cr,97.07,1.0,12.65

In [175]:
cars.nsmallest(3,'Price')

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
1713,1713,TATA NANO LX,Pune,2011,65000,Petrol,Manual,second,26.0 kmpl,NaN,35 bhp,4.0,NaN,0.44,2.0,26.0
1628,1628,MARUTI 800 STD BSIII,Jaipur,2004,12000,Petrol,Manual,second,16.1 kmpl,NaN,37 bhp,4.0,NaN,0.45,2.0,16.1
2847,2847,HYUNDAI GETZ GLS,Pune,2005,86000,Petrol,Manual,second,15.3 kmpl,NaN,83 bhp,5.0,NaN,0.45,2.0,15.3

In [178]:
cars['Owner_Type'].replace(['first','second','third','fourth'],[1,2,3,4],inplace=True)
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
0,0,MARUTI WAGON R LXI CNG,Mumbai,2010,72000,CNG,Manual,1,26.6 km/kg,NaN,58.16 bhp,5.0,NaN,1.75,1.0,26.6
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,1,19.67 kmpl,NaN,126.2 bhp,5.0,NaN,12.50,1.0,19.67
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,1,18.2 kmpl,NaN,88.7 bhp,5.0,8.61 Lakh,4.50,1.0,18.2
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,1,20.77 kmpl,NaN,88.76 bhp,7.0,NaN,6.00,1.0,20.77
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,2,15.2 kmpl,NaN,140.8 bhp,5.0,NaN,17.74,2.0,15.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,VOLKSWAGEN VENTO DIESEL TRENDLINE,Hyderabad,2011,89411,Diesel,Manual,1,20.54 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,1.0,20.54
7249,7249,VOLKSWAGEN POLO GT TSI,Mumbai,2015,59000,Petrol,Automatic,1,17.21 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,1.0,17.21
7250,7250,NISSAN MICRA DIESEL XV,Kolkata,2012,28000,Diesel,Manual,1,23.08 kmpl,NaN,63.1 bhp,5.0,NaN,NaN,1.0,23.08
7251,7251,VOLKSWAGEN POLO GT TSI,Pune,2013,52262,Petrol,Automatic,3,17.2 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,3.0,17.2
7252,7252,MERCEDES-BENZ E-CLASS 2009-2013 E 220 CDI AVAN...,Kochi,2014,72443,Diesel,Automatic,1,10.0 kmpl,NaN,170 bhp,5.0,NaN,NaN,1.0,10.0

In [179]:
import warnings
warnings.filterwarnings('ignore')

In [180]:
cars['Location'].replace('Mumbai','New Mumbai',inplace=True)
cars

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Owner,Average
0,0,MARUTI WAGON R LXI CNG,New Mumbai,2010,72000,CNG,Manual,1,26.6 km/kg,NaN,58.16 bhp,5.0,NaN,1.75,1.0,26.6
1,1,HYUNDAI CRETA 1.6 CRDI SX OPTION,Pune,2015,41000,Diesel,Manual,1,19.67 kmpl,NaN,126.2 bhp,5.0,NaN,12.50,1.0,19.67
2,2,HONDA JAZZ V,Chennai,2011,46000,Petrol,Manual,1,18.2 kmpl,NaN,88.7 bhp,5.0,8.61 Lakh,4.50,1.0,18.2
3,3,MARUTI ERTIGA VDI,Chennai,2012,87000,Diesel,Manual,1,20.77 kmpl,NaN,88.76 bhp,7.0,NaN,6.00,1.0,20.77
4,4,AUDI A4 NEW 2.0 TDI MULTITRONIC,Coimbatore,2013,40670,Diesel,Automatic,2,15.2 kmpl,NaN,140.8 bhp,5.0,NaN,17.74,2.0,15.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,VOLKSWAGEN VENTO DIESEL TRENDLINE,Hyderabad,2011,89411,Diesel,Manual,1,20.54 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,1.0,20.54
7249,7249,VOLKSWAGEN POLO GT TSI,New Mumbai,2015,59000,Petrol,Automatic,1,17.21 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,1.0,17.21
7250,7250,NISSAN MICRA DIESEL XV,Kolkata,2012,28000,Diesel,Manual,1,23.08 kmpl,NaN,63.1 bhp,5.0,NaN,NaN,1.0,23.08
7251,7251,VOLKSWAGEN POLO GT TSI,Pune,2013,52262,Petrol,Automatic,3,17.2 kmpl,NaN,103.6 bhp,5.0,NaN,NaN,3.0,17.2
7252,7252,MERCEDES-BENZ E-CLASS 2009-2013 E 220 CDI AVAN...,Kochi,2014,72443,Diesel,Automatic,1,10.0 kmpl,NaN,170 bhp,5.0,NaN,NaN,1.0,10.0

In [182]:
cars[['Location','Year']]

        Location  Year
0     New Mumbai  2010
1           Pune  2015
2        Chennai  2011
3        Chennai  2012
4     Coimbatore  2013
...          ...   ...
7248   Hyderabad  2011
7249  New Mumbai  2015
7250     Kolkata  2012
7251        Pune  2013
7252       Kochi  2014

[7253 rows x 2 columns]

# joinnig and merging

In [183]:
Amazon=pd.DataFrame({'Product_Name':['shooes','lipstick','Top','saree'],
                    'deliver_Location':['pune','mumbai','nashik','banglore'],
                    'product_price':[1500,3000,6789,1200]
})
Amazon

  Product_Name deliver_Location  product_price
0       shooes             pune           1500
1     lipstick           mumbai           3000
2          Top           nashik           6789
3        saree         banglore           1200

In [185]:
Filfkart=pd.DataFrame({'Product_Name':['shirt','pants','hair_mask','face_mask'],
                      'deliver_Location':['dhule','jalgaon','indor','chalisgaon'],
                      'product_price':[1230,4500,5698,8765]})
Filfkart

  Product_Name deliver_Location  product_price
0        shirt            dhule           1230
1        pants          jalgaon           4500
2    hair_mask            indor           5698
3    face_mask       chalisgaon           8765

In [187]:
pd.concat([Amazon,Filfkart],ignore_index=True)

  Product_Name deliver_Location  product_price
0       shooes             pune           1500
1     lipstick           mumbai           3000
2          Top           nashik           6789
3        saree         banglore           1200
4        shirt            dhule           1230
5        pants          jalgaon           4500
6    hair_mask            indor           5698
7    face_mask       chalisgaon           8765

In [188]:
pd.concat([Amazon,Filfkart],axis=1)

,Product_Name,deliver_Location,product_price,Product_Name,deliver_Location,product_price
0,shooes,pune,1500,shirt,dhule,1230
1,lipstick,mumbai,3000,pants,jalgaon,4500
2,Top,nashik,6789,hair_mask,indor,5698
3,saree,banglore,1200,face_mask,chalisgaon,8765